ACLAB-HCMUT/Thesis_Integrate_UWB_For_Lab/STM32_Firmware/main.c
                    /* Check that the frame is the expected response from the companion "DS TWR responder" example.
                     * As the sequence number field of the frame is not relevant, it is cleared to simplify the validation of the frame. */
                    if(rx_buffer[ALL_MSG_TAG_IDX] != TAG_ID)
                        continue;

                    rx_buffer[ALL_MSG_SN_IDX] = 0;
                    rx_buffer[ALL_MSG_TAG_IDX] = 0;
                    if (memcmp(rx_buffer, distance_msg, ALL_MSG_COMMON_LEN) == 0)
                    {
                        final_distance = rx_buffer[10] + (float)rx_buffer[11]/100;
                        Anthordistance[rx_buffer[12]] +=(int)(final_distance*1000);
                        Anthordistance_count[rx_buffer[12]] ++;
                        if(Anthordistance_count[0]>=ANCHOR_REFRESH_COUNT || Anthordistance_count[1]>=ANCHOR_REFRESH_COUNT ||Anthordistance_count[2]>=ANCHOR_REFRESH_COUNT ||Anthordistance_count[3]>=ANCHOR_REFRESH_COUNT)
                        {
                            distance_mange();
                            Anthordistance_count[0]= 0 ;
                            Anthordistance_count[1]= 0 ;
                            Anthordistance_count[2]= 0 ;
                            Anthordistance[0] = 0;
                            Anthordistance[1] = 0;
                            Anthordistance[2] = 0;
                        }
                    }
                }
                else
                {
                    /* Clear RX error events in the DW1000 status register. */
                    dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_ALL_RX_ERR);
                }
            }
        }
        else
        {
            /* Clear RX error events in the DW1000 status register. */
			//sprintf(dist_str, "%08x",status_reg);
   			//OLED_ShowString(0, 2," 		   "); OLED_ShowString(0, 2,dist_str);
            dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_ALL_RX_ERR);
        }

        /* Execute a delay between ranging exchanges. */
        // deca_sleep(RNG_DELAY_MS);
        frame_seq_nb++;
    }

}
void usart0_init(void)
{
//   /* USARTx configured as follow:
//         - BaudRate = 115200 baud
//         - Word Length = 8 Bits
//         - One Stop Bit
//         - No parity
//         - Hardware flow control disabled (RTS and CTS signals)
//         - Receive and transmit enabled
//   */
    USART_InitStructure.USART_BaudRate = 115200;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    STM_EVAL_COMInit(COM1, &USART_InitStructure);
}

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
//   /*!< At this stage the microcontroller clock setting is already configured,
//        this is done through SystemInit() function which is called from startup
//        file (startup_stm32f10x_xx.s) before to branch to application main.
//        To reconfigure the default setting of SystemInit() function, refer to
//        system_stm32f10x.c file
//      */

double final_distance =  0;
int main(void)
{
    uint8 anthor_index = 0;
    uint8 tag_index = 0;

    uint8 Semaphore_Enable = 0 ;
    uint8 Waiting_TAG_Release_Semaphore = 0;
    int8 frame_len = 0;

    /* Start with board specific hardware init. */
    peripherals_init();
    usart0_init();
    OLED_ShowString(0,0,"DS TWR ANTHOR");
    printf("hello dwm1000!\r\n");

    /* Reset and initialise DW1000.
     * For initialisation, DW1000 clocks must be temporarily set to crystal speed. After initialisation SPI rate can be increased for optimum
     * performance. */
    reset_DW1000(); /* Target specific drive of RSTn line into DW1000 low for a period. */
    OLED_ShowString(0,0,"INIT FAIL");
    spi_set_rate_low();
    if(dwt_initialise(DWT_LOADUCODE) == -1)
    {
        printf("dwm1000 init fail!\r\n");
        OLED_ShowString(0,0,"INIT FAIL");
        while (1)
        {
            STM_EVAL_LEDOn(LED1);
            deca_sleep(100);
            STM_EVAL_LEDOff(LED1);
            deca_sleep(100);
        }
    }
    spi_set_rate_high();

    /* Configure DW1000. See NOTE 6 below. */
    dwt_configure(&config);
    dwt_setleds(1);
    /* Apply default antenna delay value. See NOTE 1 below. */
    dwt_setrxantennadelay(RX_ANT_DLY);
    dwt_settxantennadelay(TX_ANT_DLY);
    OLED_ShowString(0,0,"INIT PASS");


    // I2C_Test();
    //AT24C02_Write(I2C1, 0xA0, 10, 123); //0xA0=> address device; 10=> address byte;123 => write value in address byte;
    //printf("IIC write pass!\r\n");
    // wait >= 10ms

    //sprintf(dist_str, "IIC: %d", AT24C02_Read(I2C1, 0xA0, 10));//0xA0=> address device; 10=> address byte;
    // USART_puts(dist_str,10);
    // printf("init pass!\r\n");
    //OLED_ShowString(0,0,dist_str);
    //while(1);
    AnchorList[0].x =0.12;
    AnchorList[0].y =0.34;
    AnchorList[0].z =0;

    AnchorList[1].x =0.25;
    AnchorList[1].y =0;
    AnchorList[1].z =0;

    AnchorList[2].x =0;
    AnchorList[2].y =0;
    AnchorList[2].z =0;
    int rx_ant_delay =32880;
    int index = 0 ;
#ifdef ANTHOR
    /* Loop forever initiating ranging exchanges. */
    OLED_ShowString(0,0,"DS TWR ANTHOR");
    OLED_ShowString(0,2,"Distance:");

    //KalMan_PramInit();

    while (1)
    {
        /* Clear reception timeout to start next ranging process. */
        dwt_setrxtimeout(0);
        /* Activate reception immediately. */
        dwt_rxenable(0);

        /* Poll for reception of a frame or error/timeout. See NOTE 7 below. */
        while (!((status_reg = dwt_read32bitreg(SYS_STATUS_ID)) & (SYS_STATUS_RXFCG | SYS_STATUS_ALL_RX_ERR)))
        { };

        if (status_reg & SYS_STATUS_RXFCG)
        {
            /* Clear good RX frame event in the DW1000 status register. */
            dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG);

